templates = [
    {
        '77': {'r': False, 't': 1, 'misc': {}},
        'yu': {
            'r': False,
            't': 10,
            'misc': {
                'ooo': {'r': False, 't': 1, 'misc': {}},
                '_opt': ['ooo', '温度单位'],
                '温度单位': {'r': False, 't': 6, 'misc': {'grp': [], 'opt': ['℃', '华氏度', 'k']}}
            }
        },
        '765': {'r': False, 't': 5, 'misc': {'multi': False}},
        '996': {'r': False, 't': 3, 'misc': {'type': 0}},
        '4444': {'r': False, 't': 1, 'misc': {}},
        '6666': {
            'r': False,
            't': 6,
            'misc': {'grp': [{'name': '000', 'items': ['ppp', '999']}], 'opt': ['6666', '99', '88']}},
        '_ord': ['基本性质', '成分与比例', '原材料信息', '性能测试', '条件与参数', '性能相关图片',
                 '性能相关附件', '数据来源', '4444', '55555', '77', '996', '765', '选择一下', '6666', 'yu'],
        '55555': {'r': False, 't': 2, 'misc': {}},
        '基本性质': {
            'r': False,
            't': 9,
            'misc': {
                '7777': {
                    'r': False,
                    't': 9,
                    'misc': {
                        '888': {'r': False, 't': 3, 'misc': {'type': 0}},
                        '_ord': ['课程', '888', '温度'],
                        '温度': {'r': False, 't': 2, 'misc': {'unit': '℃'}},
                        '课程': {'r': False, 't': 1, 'misc': {}}
                    }
                },
                '_ord': ['一级分类111', '二级分类', '三级分类', '专题一级分类', '专题二分类',
                         '专题名称', '牌号名称', '材料名称', '7777'],
                '三级分类': {'r': False, 't': 6, 'misc': {'grp': [], 'opt': ['Ni基', '粉末镍基高温合金']}},
                '专题名称': {'r': False, 't': 1, 'misc': {}},
                '二级分类': {'r': False, 't': 6, 'misc': {'grp': [], 'opt': ['高温合金', '粉末冶金']}},
                '材料名称': {'r': False, 't': 1, 'misc': {}},
                '牌号名称': {'r': False, 't': 1, 'misc': {}},
                '一级分类111': {'r': False, 't': 6, 'misc': {'grp': [], 'opt': ['有色金属材料及特种合金', '黑色金属材料']}},
                '专题二分类': {'r': False, 't': 6, 'misc': {'grp': [], 'opt': ['Ni基高温合金']}},
                '专题一级分类': {'r': False, 't': 6, 'misc': {'grp': [], 'opt': ['高温合金']}}
            }
        },
        '性能测试': {
            'r': False,
            't': 8,
            'misc': {
                '_head': ['性能类别', '性能名称', '性能值', '性能单位', '测试设备与型号', '检测机构名称'],
                '性能值': {'r': False, 't': 2, 'misc': {}},
                '性能单位': {'r': False, 't': 1, 'misc': {}},
                '性能名称': {'r': False, 't': 6, 'misc': {'grp': [], 'opt': ['屈服强度', '应变率']}},
                '性能类别': {'r': False, 't': 6, 'misc': {'grp': [], 'opt': ['力学性能']}},
                '检测机构名称': {'r': False, 't': 1, 'misc': {}},
                '测试设备与型号': {'r': False, 't': 1, 'misc': {}}
            }
        },
        '数据来源': {
            'r': False,
            't': 9,
            'misc': {
                '_ord': [
                    '数据来源方式',
                    '摘录出处',
                    '数据生产者',
                    '数据审核者',
                    '数据DOI',
                    '备注',
                    '数据采集时间'
                ],
                '备注': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '数据DOI': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '摘录出处': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '数据审核者': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '数据生产者': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '数据来源方式': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '数据采集时间': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                }
            }
        },
        '选择一下': {
            'r': False,
            't': 10,
            'misc': {
                '55': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '555': {
                    'r': False,
                    't': 2,
                    'misc': {

                    }
                },
                '5566': {
                    'r': False,
                    't': 7,
                    'misc': {
                        'r': False,
                        't': 1,
                        'misc': {

                        }
                    }
                },
                '_opt': [
                    '55',
                    '555',
                    '55555',
                    '5566'
                ],
                '55555': {
                    'r': False,
                    't': 5,
                    'misc': {
                        'multi': False
                    }
                }
            }
        },
        '原材料信息': {
            'r': False,
            't': 8,
            'misc': {
                '_head': [
                    '原材料名称',
                    '性能',
                    '性能值',
                    '性能单位',
                    '生产方法',
                    '生产商',
                    '原材料备注'
                ],
                '性能': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '性能值': {
                    'r': False,
                    't': 2,
                    'misc': {

                    }
                },
                '生产商': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '性能单位': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '生产方法': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '原材料名称': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '原材料备注': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                }
            }
        },
        '成分与比例': {
            'r': False,
            't': 8,
            'misc': {
                '_head': [
                    '成分名称',
                    '成分比例'
                ],
                '成分名称': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '成分比例': {
                    'r': False,
                    't': 2,
                    'misc': {
                        'unit': 'wt.%'
                    }
                }
            }
        },
        '条件与参数': {
            'r': False,
            't': 8,
            'misc': {
                '_head': [
                    '条件名称',
                    '参数名',
                    '参数值',
                    '单位'
                ],
                '单位': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '参数值': {
                    'r': False,
                    't': 2,
                    'misc': {

                    }
                },
                '参数名': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                },
                '条件名称': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                }
            }
        },
        '性能相关图片': {
            'r': False,
            't': 4,
            'misc': {
                'multi': True
            }
        },
        '性能相关附件': {
            'r': False,
            't': 5,
            'misc': {
                'multi': True
            }
        }
    },
    {
        '_ord': ['字符串', '数值型'],
        '字符串': {
            'r': False,
            't': 1,
            'misc': {}
        },
        '数值型': {
            't': 2,
            'r': True,
            'misc': {'unit': 'C'}
        }
    },
    {
        '_ord': ['字符串', '数值型', '区间型', '误差型', '图片', '文件', '容器', '生成器', '字符数组', '区间数组',
                 '容器数组', '生成器数组'],
        '图片': {'r': False, 't': 4, 'misc': {'multi': True}},
        '容器': {
            'r': False,
            't': 9,
            'misc': {
                '_ord': ['字符串', '容器'],
                '容器': {
                    'r': False,
                    't': 9,
                    'misc': {
                        '_ord': ['数值型'],
                        '数值型': {'r': False, 't': 2, 'misc': {}}
                    }
                },

                '字符串': {
                    'r': False,
                    't': 1,
                    'misc': {}
                }
            }
        },
        '文件': {'r': False, 't': 5, 'misc': {'multi': False}},
        '区间型': {'r': False, 't': 3, 'misc': {'type': 0, 'unit': 'C'}},
        '字符串': {'r': False, 't': 1, 'misc': {}},
        '数值型': {'r': False, 't': 2, 'misc': {}},
        '生成器': {
            'r': False,
            't': 10,
            'misc': {
                '_opt': ['字符串', '数值型'],
                '字符串': {'r': False, 't': 1, 'misc': {}},
                '数值型': {'r': False, 't': 2, 'misc': {}}
            }
        },
        '误差型': {'r': False, 't': 3, 'misc': {'type': 1}},
        '区间数组': {'r': False, 't': 7, 'misc': {'r': False, 't': 3, 'misc': {'type': 0}}},
        '字符数组': {'r': False, 't': 7, 'misc': {'r': False, 't': 1, 'misc': {}}},
        '容器数组': {
            'r': False,
            't': 7,
            'misc': {
                'r': False,
                't': 9,
                'misc': {
                    '_ord': ['字符串', '容器'],
                    '容器': {
                        'r': False,
                        't': 9,
                        'misc': {
                            '_ord': ['字符串'],
                            '字符串': {'r': False, 't': 1, 'misc': {}}
                        }
                    },

                    '字符串': {'r': False, 't': 1, 'misc': {}}
                }
            }
        },
        '生成器数组': {
            'r': False,
            't': 7,
            'misc': {
                'r': False,
                't': 10,
                'misc': {
                    '_opt': ['字符串', '数值', '容器'],

                    '容器': {
                        'r': False,
                        't': 9,
                        'misc': {
                            '_ord': ['字符串'],
                            '字符串': {'r': False, 't': 1, 'misc': {}}
                        }
                    },
                    '数值': {'r': False, 't': 2, 'misc': {}},
                    '字符串': {'r': False, 't': 1, 'misc': {}}
                }
            }
        }
    },
    {
        '_ord': [
            '表格'
        ],
        '表格': {
            'r': False,
            't': 8,
            'misc': {
                '_head': [
                    '字符串',
                    '数值',
                    '范围',
                    '候选'
                ],
                '候选': {
                    'r': False,
                    't': 6,
                    'misc': {
                        'grp': [
                            {
                                'name': 'G1',
                                'items': [
                                    'C',
                                    'D'
                                ]
                            }
                        ],
                        'opt': [
                            'A',
                            'B'
                        ]
                    }
                },
                '数值': {
                    'r': False,
                    't': 2,
                    'misc': {

                    }
                },
                '范围': {
                    'r': False,
                    't': 3,
                    'misc': {
                        'type': 0
                    }
                },
                '字符串': {
                    'r': False,
                    't': 1,
                    'misc': {

                    }
                }
            }
        }
    },
    {
        "_ord": [
            "材料牌号",
            "标准",
            "备注",
            "对应牌号",
            "化学成分",
            "加工工艺",
            "性能信息",
            "数据生产与审核"
        ],
        "备注": {
            "r": False,
            "t": 1,
            "misc": {}
        },
        "标准": {
            "r": False,
            "t": 1,
            "misc": {}
        },
        "加工工艺": {
            "r": False,
            "t": 8,
            "misc": {
                "_head": [
                    "加工工艺代号",
                    "加工工艺名称",
                    "加工工艺说明",
                    "工艺标准"
                ],
                "工艺标准": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "加工工艺代号": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "加工工艺名称": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "加工工艺说明": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                }
            }
        },
        "化学成分": {
            "r": False,
            "t": 8,
            "misc": {
                "_head": [
                    "成分",
                    "含量(wt%)"
                ],
                "成分": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "含量(wt%)": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                }
            }
        },
        "对应牌号": {
            "r": False,
            "t": 1,
            "misc": {}
        },
        "性能信息": {
            "r": False,
            "t": 8,
            "misc": {
                "Kt": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "_head": [
                    "性能类别",
                    "性能名称",
                    "技术标准",
                    "品种",
                    "取样方向",
                    "温度",
                    "δ或其他规格/mm",
                    "Kt",
                    "热暴露条件",
                    "性能值",
                    "单位"
                ],
                "单位": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "品种": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "温度": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "性能值": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "取样方向": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "性能名称": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "性能类别": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "技术标准": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "热暴露条件": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "δ或其他规格/mm": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                }
            }
        },
        "材料牌号": {
            "r": True,
            "t": 1,
            "misc": {}
        },
        "数据生产与审核": {
            "r": False,
            "t": 8,
            "misc": {
                "_head": [
                    "数据生产者",
                    "数据审核者"
                ],
                "数据审核者": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                },
                "数据生产者": {
                    "r": False,
                    "t": 1,
                    "misc": {}
                }
            }
        }
    }
]
